load-tests/artillery.yml
config:
  target: "https://takenote.dev/app"
  phases:
    - duration: 90
      arrivalCount: 10
      rampTo: 20
      name: Warm up phase
  engines:
    playwright:
      extendedMetrics: true
      launchOptions:
        headless: true
      trace:
        enabled: true
  processor: "./NoteCreationLoadTest.ts"
scenarios:
  - engine: playwright
    testFunction: createAndFavoriteNote