load-tests/artillery.yml
config:
  target: "https://www.artillery.io"
  phases:
    - duration: 90
      arrivalCount: 10
      rampTo: 20
      name: Warm up phase
  engines:
    playwright:
      extendedMetrics: true
      launchOptions:
        headless: true
      traceOptions:
        enabled: true
        maxConcurrentRecordings: 5
  processor: "./NoteCreationLoadTest.ts"
scenarios:
  - engine: playwright
    testFunction: createAndFavoriteNote